{
  "main": {
    "name":"Alec Cumming",
    "description":"I am a software developer with a strong foundation in computer science, having recently graduated from UBC with a degree in Computer Science. I am actively seeking a software engineering position to apply my expertise and continue learning in a professional environment. I am passionate about staying up-to-date with emerging technologies and enjoy collaborating with diverse teams to create innovative solutions. If you are looking for a motivated and dedicated software developer with a strong academic background, I would be thrilled to discuss how I can contribute to your organization. Please feel free to reach out to me regarding any software engineering opportunities available",
    "image":"profilepic.jpg",
    "bio":"I am a computer science graduate with a strong passion for technology and a background in athletics. As a former UBC baseball player, I have honed my discipline and teamwork skills both on and off the field. One of my defining traits is my addictive personality, which fuels my deep passion for whatever I set my mind to, be it hobbies, academic pursuits, or sports. This enthusiasm drives me to continually seek knowledge and excel in my endeavors. Beyond my academic and professional pursuits, I love playing sports and enjoying the outdoors. However, during less favorable weather, I enjoy solving puzzles, playing music, and spending quality time with friends and family. \n\n Now, as a fresh graduate, I am excited to bring my dedication, discipline, and love for continuous learning to a software development team. I am genuinely enthusiastic about technology and eager to apply my skills and knowledge in a professional setting. Through my experience in baseball, I have developed strong teamwork and communication skills and an unwavering commitment to achieving goals. I believe these qualities, often undervalued and underrepresented in the software engineering world, enable me to bring a fresh perspective and contribute to the success of your team. If you are seeking a software developer who not only possesses a solid academic foundation but also brings a unique set of soft skills acquired through competitive baseball, I would be delighted to discuss how I can add value to your organization.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "alecgcumming@gmail.com",
    "phone": "604-842-5385",
    "github":"https://github.com/aleccumming",
    "project":"https://github.com/aleccumming",
    "address":{
      "street":"350 Moyne Dr",
      "city":"West Vancouver",
      "state":"BC",
      "zip": "V7S 1J5"
    },
    "website": "http://www.alecgcumming.com",
    "resumedownload":"resume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/alec-cumming-6008801a8/",
        "className":"fa fa-linkedin"
      },
      {
        "name": "resume",
        "url": "files/resume.pdf",
        "className": "fa fa-file"
      },
      {
        "name":"email",
        "url":"mailto: alecgcumming@gmail.com",
        "className":"fa fa-envelope"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/alec.gc/",
        "className":"fa fa-instagram"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":"University of British Columbia",
        "degree":"Bachelor of Science, Computer Science",
        "years":"September 2017 - May 2023",
        "description":"As a student athlete, I have learned to work hard in practice and be accountable for my performance. This experience has helped me develop strong communication skills and a team-oriented mentality. Additionally, through my years of playing baseball, I have been able to acquire qualities like time management that are useful in any workplace environment. Finally, my specialization in computer science has made me eager to learn more about programming languages, development software, and production infrastructure. These are all areas of growing interest for me as I continue my education as a growing software engineer."
      }
    ],
    "work":[
      {
        "company":"Bit Quill Technologies",
        "title":"Software Developer 1",
        "years":"May 2022 - January 2023",
        "description":"During my tenure at Bit Quill Technologies, I played a pivotal role in the development and continuous enhancement of the JDBC driver for Amazon Aurora. This involved a multifaceted approach, encompassing code reviews, bug resolution, performance optimization, and addressing customer issues. A significant achievement during my time there was the creation of a vital plugin, which permitted users to securely connect to Amazon Aurora clusters through AWS Identity and Access Management (IAM). In addition to this, I took the initiative to craft a comprehensive user configuration guide for this newly devised IAM Authentication plugin, ensuring that users could seamlessly configure and harness the power of this cutting-edge security feature. My involvement in this project showcased my proficiency in a range of technologies, including Java, C++, Amazon Aurora, and GitHub Actions, and underscored my commitment to delivering high-quality solutions in the realm of software engineering."
      },
      {
        "company":"Absolute Software",
        "title":"Associate QA Automation Engineer",
        "years":"January 2021 - September 2021",
        "description":"While working at at Absolute Software, I assumed a dynamic role that revolved around optimizing our software engineering processes. A key contribution was the development of Python automation tools aimed at enhancing the efficiency of data collection from performance tests and automating data posting to Confluence. This initiative not only improved data accuracy but also resulted in significant time savings for the team, fostering better collaboration and knowledge sharing. In addition, I took the lead in coordinating the migration of our legacy testing suite, where I played a pivotal role in introducing component testing methodologies to bolster software quality assurance. My role involved close collaboration with the Development and Program Management teams, working hand in hand to identify and resolve issues and ensure the seamless execution of our automation processes. Throughout these endeavors, I leveraged a versatile skill set encompassing Java, Python, Jenkins, and Docker to drive innovation and enhance our software engineering capabilities."
      },
      {
        "company":"Bizkinnect LLC",
        "title":"Full Stack Developer",
        "years":"September 2020 - December 2020",
        "description":"In my role at Bizkinnect, I had the opportunity to work on a dynamic web-based application where I was responsible for the full-stack development, encompassing both front-end and back-end components. Leveraging my expertise in JavaScript, Node.js, Express.js, and React, I ensured the seamless and intuitive user experiences that were central to our product's success. Collaborating closely with cross-functional teams, I played a pivotal role in implementing software enhancements driven by valuable customer feedback, leading to significant improvements in product usability and overall satisfaction. Additionally, I designed and implemented RESTful APIs, which served as a vital bridge between our front-end and back-end systems, resulting in enhanced data flow and superior system performance. My technology stack encompassed a wide range of tools, including JavaScript, React.js, Node.js, AWS Lambda, and MySQL, providing me with a versatile toolkit to deliver exceptional solutions."
      }
    ],
    "projects":[
      {
        "name":"UBC LaunchPad: Workout Personalizer",
        "tech":"Flutter/TypeScript",
        "years":"September 2021 - May 2022",
        "description":"I played a pivotal role in the development of a fitness-focused web application as part of the UBC LaunchPad club. My primary contributions encompassed the creation of an intuitive user interface featuring a dynamic catalog of exercises, enhancing the user experience by simplifying exercise selection for fitness routines. To ensure seamless data retrieval, I constructed a robust Express.js backend, optimizing its efficiency in fetching exercise data from a PostgreSQL database. Moreover, I actively collaborated with a group of junior developers, offering valuable mentorship and guidance throughout their maiden venture into web application development. My commitment extended to participating in weekly team discussions, contributing to decisions about application features and design, and fostering a collaborative and dynamic development environment."
      },
      {
        "name":"InsightUBC Query Application",
        "tech":"TypeScript",
        "years":"September 2021 - December 2021",
        "description":"In a collaborative class project centered around querying information about UBC courses and classrooms, I contributed to enhancing the project's functionality and reliability. To bolster code robustness, I developed a comprehensive local test suite leveraging Mocha and Chai, which not only identified but effectively captured mutations within the codebase, ensuring a higher level of code reliability and error-free performance. To streamline data extraction from web sources and reduce manual data processing efforts, I designed and implemented a custom HTML parser, greatly enhancing our ability to extract the requested information efficiently. In addition, I contributed to the project by constructing a set of HTTP endpoints, which facilitated seamless dataset management, enabling users to effortlessly add, remove, and query datasets. These contributions collectively advanced the project's capabilities, delivering a more robust and user-friendly experience for our audience."
      },
      {
        "name":"Jammming",
        "tech":"JavaScript",
        "years":"February 2020 - April 2020",
        "description":"During my participation in the 'Build Front-End Web Applications from Scratch' course on Codecademy, I designed a user-friendly front-end interface and developed a web application. This application seamlessly integrates with Spotify, enabling users to add songs to their playlists. By utilizing the Spotify API, I connected our app to Spotify's extensive music library, allowing users to easily search for and select songs by their favorite artists and genres. I also implemented real-time data fetching from the Spotify API to ensure users had access to the latest music offerings. This project highlighted my technical skills and commitment to user-centered software engineering solutions."
      },
      {
        "name":"Doodle Jump Clone",
        "tech":"Java",
        "years":"December 2019 - January 2020",
        "description":"One of my early solo projects in software engineering was creating a Doodle Jump clone, inspired by the popular iPhone app. In this project, I gained valuable experience in mobile game development, implementing player controls and collision detection for a solid gaming experience. I also introduced a basic gravity system and a camera abstraction to support continuous climbing. Handling user input through event listeners, I aimed to provide an enjoyable gaming experience and learned valuable lessons in the process."
      },
      {
        "name":"Travelling Salesman Problem",
        "tech":"Haskell",
        "years":"September 2019 - December 2019",
        "description":"In a fascinating project centered on solving the Traveling Salesman Problem using Haskell, I demonstrated a robust command of functional programming and algorithmic problem-solving. Leveraging Eerke Boiten's Travelling Salesman Heuristics as a foundational framework, I showcased a deep understanding of existing algorithms and their practical applications. To offer a comprehensive solution, I meticulously implemented two distinct approaches: a brute force search algorithm using a distance matrix representation of towns and a nearest neighbor heuristic search algorithm, both aimed at achieving efficient and near-optimal route planning. To ensure the code's readability and maintainability, I capitalized on Haskell's functional programming features, including pattern matching and list comprehensions. This project not only underscored my commitment to excellence in algorithm design but also highlighted my expertise in functional programming, further solidifying my reputation as a skilled software engineer."
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"60%"
      },
      {
        "name":"VueJs",
        "level":"55%"
      },
      {
        "name":"ReactJs",
        "level":"50%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"PHP",
        "level":"80%"
      },
      {
        "name":"Swift",
        "level":"50%"
      },
      {
        "name":"JAVA",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Workout Personalizer",
        "category":"UBC LaunchPad club web application for a smoother workout experience",
        "image":"fithub.jpg",
        "url":"https://github.com/ubclaunchpad/workoutpersonalizer-frontend"
      },
      {
        "title":"InsightUBC Query Application",
        "category":"Course project to query about information regarding UBC courses and classrooms",
        "image":"insightubc.png",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"original-thai-food.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"resume-website.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"smirkspace.jpg",
        "url":"http://www.smirkspace.com"
      }
    ]
  }
}
