{
  "main": {
    "name":"Alec Cumming",
    "description":"I am a software developer with a strong foundation in computer science, having recently graduated from UBC with a degree in Computer Science. I am actively seeking a software engineering position to apply my expertise and continue learning in a professional environment. I am passionate about staying up-to-date with emerging technologies and enjoy collaborating with diverse teams to create innovative solutions. If you are looking for a motivated and dedicated software developer with a strong academic background, I would be thrilled to discuss how I can contribute to your organization. Please feel free to reach out to me regarding any software engineering opportunities available",
    "image":"profilepic.jpg",
    "bio":"I am a computer science graduate with a strong passion for technology and a background in athletics. As a former UBC baseball player, I have honed my discipline and teamwork skills both on and off the field. One of my defining traits is my addictive personality, which fuels my deep passion for whatever I set my mind to, be it hobbies, academic pursuits, or sports. This enthusiasm drives me to continually seek knowledge and excel in my endeavors. Beyond my academic and professional pursuits, I love playing sports and enjoying the outdoors. However, during less favorable weather, I enjoy solving puzzles, playing music, and spending quality time with friends and family. \n\n Now, as a fresh graduate, I am excited to bring my dedication, discipline, and love for continuous learning to a software development team. I am genuinely enthusiastic about technology and eager to apply my skills and knowledge in a professional setting. Through my experience in baseball, I have developed strong teamwork and communication skills and an unwavering commitment to achieving goals. I believe these qualities, often undervalued and underrepresented in the software engineering world, enable me to bring a fresh perspective and contribute to the success of your team. If you are seeking a software developer who not only possesses a solid academic foundation but also brings a unique set of soft skills acquired through competitive baseball, I would be delighted to discuss how I can add value to your organization.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "alecgcumming@gmail.com",
    "phone": "604-842-5385",
    "github":"https://github.com/aleccumming",
    "project":"https://github.com/aleccumming",
    "address":{
      "street":"350 Moyne Dr",
      "city":"West Vancouver",
      "state":"BC",
      "zip": "V7S 1J5"
    },
    "website": "http://www.alecgcumming.com",
    "resumedownload":"resume.pdf",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/alec.cummando/",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/alecgc15",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/alec-cumming-6008801a8/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/alec.gc/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/aleccumming",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":"University of British Columbia",
        "degree":"Bachelor of Science, Computer Science",
        "years":"September 2017 - present",
        "description":"As a student athlete, I have learned to work hard in practice and be accountable for my performance. This experience has helped me develop strong communication skills and a team-oriented mentality. Additionally, through my years of playing baseball, I have been able to acquire qualities like time management that are useful in any workplace environment. Finally, my specialization in computer science has made me eager to learn more about programming languages, development software, and production infrastructure. These are all areas of growing interest for me as I continue my education as a growing software engineer."
      }
    ],
    "work":[
      {
        "company":"Bit Quill Technologies",
        "title":"Software Developer 1",
        "years":"May 2022 - Present",
        "description":"I contributed to the release of a JDBC driver for Amazon Aurora. I implemented a plugin which enables users to connect to their Amazon Aurora clusters using AWS Identity and Access Management (IAM). Additionally, I authored a comprehensive user configuration guide for this IAM Authentication plugin. Technologies I used include Java, Amazon Aurora, Gradle, and GitHub Actions."
      },
      {
        "company":"Absolute Software",
        "title":"Associate QA Automation Engineer",
        "years":"January 2021 - September 2021",
        "description":"I created a variety of Python tools used for automation including collecting data from performance tests and posting data to confluence. I collaborated closely with Development and Program Management to address any issues and resolve configuration troubles. Additionally, I worked on the general maintenance and improvement of the automation framework. Technologies I used include Java, Python, Jenkins, and Docker."
      },
      {
        "company":"Bizkinnect LLC",
        "title":"Full Stack Developer",
        "years":"September 2020 - December 2020",
        "description":"I worked on the development of the back end and the front end of web-based application using JavaScript, NodeJS, ExpressJS, and React. Implemented the modification of software based on customer feedback reviews. Technologies I used include JavaScript, React, Node, AWS Lambda, and MySQL."
      }
    ],
    "projects":[
      {
        "name":"UBC LaunchPad: Workout Personalizer",
        "tech":"Flutter/TypeScript",
        "years":"September 2021 - May 2022",
        "description":"UBC LaunchPad club web application for a smoother workout experience. On this project I implemented a UI displaying a list of exercises that a user can select. I also implemented an Express backend to fetch data from a PostgreSQL database. Additionally, I mentored junior developers that were working on their first web application and contributed to weekly team discussions about application features and design."
      },
      {
        "name":"InsightUBC Query Application",
        "tech":"TypeScript",
        "years":"September 2021 - December 2021",
        "description":"Course project to query about information regarding UBC courses and classrooms. I created a local test suite using Mocha/Chai to catch inserted mutation in the code base. I implemented an HTML parser to extract the requested information for the user submitted query. Additionally, I created HTTP endpoints to add, remove, list, and query datasets."
      },
      {
        "name":"Jammming",
        "tech":"JavaScript",
        "years":"February 2020 - April 2020",
        "description":"Part of the 'Build Front-End Web Applications from Scratch' course on Codecademy. Designed a user interface for a web application that allows users to add songs to their Spotify playlists. Interfaced with the Spotify API to fetch songs on Spotify and add them to a playlist."
      },
      {
        "name":"Doodle Jump Clone",
        "tech":"Java",
        "years":"December 2019 - January 2020",
        "description":"A clone of the popular iPhone app, Doodle Jump. I implemented the dictation of player movement and collision detection together with gravity. I implemented a camera abstraction to allow for continuous climbing. I used event listeners to utilize mouse and keyboard handling for character navigation."
      },
      {
        "name":"Travelling Salesman Problem",
        "tech":"Haskell",
        "years":"September 2019 - December 2019",
        "description":"An implementation of the well-known Travelling Salesman Problem. We used Eerke Boiten's Travelling Salesman Heuristics as a basis for the function implementations. We compared a brute force search with a distance matrix to represent a map of the towns and a nearest neighbour heuristic search allowing for a near optimal and efficient solution by travelling to the nearest town."
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"60%"
      },
      {
        "name":"VueJs",
        "level":"55%"
      },
      {
        "name":"ReactJs",
        "level":"50%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"PHP",
        "level":"80%"
      },
      {
        "name":"Swift",
        "level":"50%"
      },
      {
        "name":"JAVA",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Workout Personalizer",
        "category":"UBC LaunchPad club web application for a smoother workout experience",
        "image":"fithub.jpg",
        "url":"https://github.com/ubclaunchpad/workoutpersonalizer-frontend"
      },
      {
        "title":"InsightUBC Query Application",
        "category":"Course project to query about information regarding UBC courses and classrooms",
        "image":"insightubc.png",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"original-thai-food.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"resume-website.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"smirkspace.jpg",
        "url":"http://www.smirkspace.com"
      }
    ]
  }
}
