{
  "main": {
    "name":"Alec Cumming",
    "description":"I am a software developer and UBC computer science student. I am a great team player and am always eager to learn about new technologies. I am currently employed by Bit Quill Technologies where I am working on the development of a JDBC driver for a multi-national cloud services company based in the pacific north west. My expected date of graduation is May 2023 and I am looking for a new grad software engineering position starting in the summer of 2023",
    "image":"profilepic.jpg",
    "bio":"I am a fifth-year computer science student and former UBC baseball player. I was born and grew up in West Vancouver and have been interested in computers and technology from a young age. One of my defining characteristics is that I have a bit of an addictive personality, meaning I tend to become deeply passionate about what I’m doing, whether it be hobbies, or studying or sports. Outside of school and work, I love playing sports and I enjoy the outdoors. However, when the weather turns and I have to spend my time indoors, I love puzzles, playing games, and spending time with my friends and family.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "alecgcumming@gmail.com",
    "phone": "604-842-5385",
    "github":"https://github.com/aleccumming",
    "project":"https://github.com/aleccumming",
    "address":{
      "street":"350 Moyne Dr",
      "city":"West Vancouver",
      "state":"BC",
      "zip": "V7S 1J5"
    },
    "website": "http://www.alecgcumming.com",
    "resumedownload":"resume.pdf",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/alec.cummando/",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/alecgc15",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/alec-cumming-6008801a8/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/alec.gc/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/aleccumming",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":"University of British Columbia",
        "degree":"Bachelor of Science, Computer Science",
        "years":"September 2017 - present",
        "description":"As a student athlete, I have learned to work hard in practice and be accountable for my performance. This experience has helped me develop strong communication skills and a team-oriented mentality. Additionally, through my years of playing baseball, I have been able to acquire qualities like time management that are useful in any workplace environment. Finally, my specialization in computer science has made me eager to learn more about programming languages, development software, and production infrastructure. These are all areas of growing interest for me as I continue my education as a growing software engineer."
      }
    ],
    "work":[
      {
        "company":"Bit Quill Technologies",
        "title":"Software Developer 1",
        "years":"May 2022 - Present",
        "description":"I contributed to the release of a JDBC driver for Amazon Aurora. I implemented a plugin which enables users to connect to their Amazon Aurora clusters using AWS Identity and Access Management (IAM). Additionally, I authored a comprehensive user configuration guide for this IAM Authentication plugin. Technologies I used include Java, Amazon Aurora, Gradle, and GitHub Actions."
      },
      {
        "company":"Absolute Software",
        "title":"Associate QA Automation Engineer",
        "years":"January 2021 - September 2021",
        "description":"I created a variety of Python tools used for automation including collecting data from performance tests and posting data to confluence. I collaborated closely with Development and Program Management to address any issues and resolve configuration troubles. Additionally, I worked on the general maintenance and improvement of the automation framework. Technologies I used include Java, Python, Jenkins, and Docker."
      },
      {
        "company":"Bizkinnect LLC",
        "title":"Full Stack Developer",
        "years":"September 2020 - December 2020",
        "description":"I worked on the development of the back end and the front end of web-based application using JavaScript, NodeJS, ExpressJS, and React. Implemented the modification of software based on customer feedback reviews. Technologies I used include JavaScript, React, Node, AWS Lambda, and MySQL."
      }
    ],
    "projects":[
      {
        "name":"UBC LaunchPad: Workout Personalizer",
        "tech":"Flutter/TypeScript",
        "years":"September 2021 - May 2022",
        "description":"UBC LaunchPad club web application for a smoother workout experience. On this project I implemented a UI displaying a list of exercises that a user can select. I also implemented an Express backend to fetch data from a PostgreSQL database. Additionally, I mentored junior developers that were working on their first web application and contributed to weekly team discussions about application features and design."
      },
      {
        "name":"InsightUBC Query Application",
        "tech":"TypeScript",
        "years":"September 2021 - December 2021",
        "description":"Course project to query about information regarding UBC courses and classrooms. I created a local test suite using Mocha/Chai to catch inserted mutation in the code base. I implemented an HTML parser to extract the requested information for the user submitted query. Additionally, I created HTTP endpoints to add, remove, list, and query datasets."
      },
      {
        "name":"Jammming",
        "tech":"JavaScript",
        "years":"February 2020 - April 2020",
        "description":"Part of the 'Build Front-End Web Applications from Scratch' course on Codecademy. Designed a user interface for a web application that allows users to add songs to their Spotify playlists. Interfaced with the Spotify API to fetch songs on Spotify and add them to a playlist."
      },
      {
        "name":"Doodle Jump Clone",
        "tech":"Java",
        "years":"December 2019 - January 2020",
        "description":"A clone of the popular iPhone app, Doodle Jump. I implemented the dictation of player movement and collision detection together with gravity. I implemented a camera abstraction to allow for continuous climbing. I used event listeners to utilize mouse and keyboard handling for character navigation."
      },
      {
        "name":"Travelling Salesman Problem",
        "tech":"Haskell",
        "years":"September 2019 - December 2019",
        "description":"An implementation of the well-known Travelling Salesman Problem. We used Eerke Boiten's Travelling Salesman Heuristics as a basis for the function implementations. We compared a brute force search with a distance matrix to represent a map of the towns and a nearest neighbour heuristic search allowing for a near optimal and efficient solution by travelling to the nearest town."
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"60%"
      },
      {
        "name":"VueJs",
        "level":"55%"
      },
      {
        "name":"ReactJs",
        "level":"50%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"PHP",
        "level":"80%"
      },
      {
        "name":"Swift",
        "level":"50%"
      },
      {
        "name":"JAVA",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Workout Personalizer",
        "category":"UBC LaunchPad club web application for a smoother workout experience",
        "image":"fithub.jpg",
        "url":"https://github.com/ubclaunchpad/workoutpersonalizer-frontend"
      },
      {
        "title":"InsightUBC Query Application",
        "category":"Course project to query about information regarding UBC courses and classrooms",
        "image":"insightubc.png",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"original-thai-food.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"resume-website.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"smirkspace.jpg",
        "url":"http://www.smirkspace.com"
      }
    ]
  }
}
